In [1]:
import pandas as pd
import numpy as np
import regex as re

In [2]:
content = pd.read_csv('data/movie_titles3.csv', index_col=False, names = ['id', 'year', 'title'])
content.head()

/var/folders/xc/4fn08svj2dgdk_3wj3xkp_rr0000gn/T/ipykernel_28252/3666075594.py:1: ParserWarning: Length of header or names does not match length of data. This leads to a loss of data with index_col=False.
  content = pd.read_csv('data/movie_titles3.csv', index_col=False, names = ['id', 'year', 'title'])

   id    year                         title
0   1  2003.0               Dinosaur Planet
1   2  2004.0    Isle of Man TT 2004 Review
2   3  1997.0                     Character
3   4  1994.0  Paula Abdul's Get Up & Dance
4   5  2004.0      The Rise and Fall of ECW

In [3]:
#checking that everything imported correctly
content.loc[content['id'] == 394]

      id    year                        title
393  394  1916.0  20000 Leagues Under the Sea

# Dataset1

In [4]:
# Reading dataset file
dataset1 = pd.read_csv('data/combined_data_1.txt',header = None, names = ['cust_id', 'rating', 'date'])
dataset1.head()

   cust_id  rating        date
0       1:     NaN         NaN
1  1488844     3.0  2005-09-06
2   822109     5.0  2005-05-13
3   885013     4.0  2005-10-19
4    30878     4.0  2005-12-26

In [26]:
dataset1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24058263 entries, 0 to 24058262
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   cust_id  object
 1   rating   float64
 2   date     object
dtypes: float64(1), object(2)
memory usage: 550.7+ MB

In [5]:
mid_tf = pd.DataFrame(dataset1['rating'].isnull())
mid_tf = mid_tf.reset_index()
mid_tf.head()

   index  rating
0      0    True
1      1   False
2      2   False
3      3   False
4      4   False

In [ ]:
#only storing index with movie id
#mid_tf = mid_tf[mid_tf['rating'] == True]
#mid_tf.head()

In [6]:
#only movie id values
mid_index = pd.DataFrame(dataset1[(dataset1['rating'].isnull())])
mid_index.head()

     cust_id  rating date
0         1:     NaN  NaN
548       2:     NaN  NaN
694       3:     NaN  NaN
2707      4:     NaN  NaN
2850      5:     NaN  NaN

In [7]:
#rename movie index
mid_index = mid_index.rename(columns = {'cust_id': 'movie_id'})
mid_index.head()

     movie_id  rating date
0          1:     NaN  NaN
548        2:     NaN  NaN
694        3:     NaN  NaN
2707       4:     NaN  NaN
2850       5:     NaN  NaN

In [ ]:
#mid_index = mid_index.drop(['rating', 'date'], axis =1)
#mid_index.head()

In [ ]:
#mid_tf.info()

In [ ]:
#mid_index = pd.concat([mid_index, mid_tf], join = 'outer')
#mid_index.head()

In [ ]:
#mid_index.info()

In [27]:
#mid_index.reset_index(inplace=True)

In [8]:
#drop movieid punctuation
def drop_punctuation(df):
    midnew = []
    for index, row in df.iterrows():
        mid1 = str(row['movie_id'])
        regex = r"[!\"#\$%&\'\(\)\*\+,-\./:;<=>\?@\[\\\]\^_`{\|}~]"
        mid1 = re.sub(regex, '', mid1)
        midnew.append(mid1)
        
    df['mid'] = midnew

    return df

In [9]:
drop_punctuation(mid_index)
mid_index = mid_index[['mid']]
mid_index.head()

     mid
0      1
548    2
694    3
2707   4
2850   5

In [17]:
mid_index.shape

(4499, 1)

In [10]:
dataset1.head()

   cust_id  rating        date
0       1:     NaN         NaN
1  1488844     3.0  2005-09-06
2   822109     5.0  2005-05-13
3   885013     4.0  2005-10-19
4    30878     4.0  2005-12-26

In [11]:
d1 = pd.concat([dataset1, mid_index], axis = 1 )

In [12]:
d1.head()

   cust_id  rating        date  mid
0       1:     NaN         NaN    1
1  1488844     3.0  2005-09-06  NaN
2   822109     5.0  2005-05-13  NaN
3   885013     4.0  2005-10-19  NaN
4    30878     4.0  2005-12-26  NaN

In [14]:
#checking for mid 5
d1.iloc[2850]

cust_id     5:
rating     NaN
date       NaN
mid          5
Name: 2850, dtype: object

In [15]:
d1 = d1.reindex(['mid', 'cust_id', 'rating', 'date'], axis= 1)
d1.head()

   mid  cust_id  rating        date
0    1       1:     NaN         NaN
1  NaN  1488844     3.0  2005-09-06
2  NaN   822109     5.0  2005-05-13
3  NaN   885013     4.0  2005-10-19
4  NaN    30878     4.0  2005-12-26

In [18]:
def fill_mids(df, column_name):
    """
    iterates through df col
    replaces nan vals with movie id until it reaches a new movie id
    """
    # Find the first non-NaN value in the column
    first_value = df[column_name].dropna().iloc[0]
    
    # Iterate through the column, filling NaNs with the previous non-NaN value
    for i in range(len(df)):
        if pd.isna(df.loc[i, column_name]):
            df.loc[i, column_name] = first_value
        else:
            first_value = df.loc[i, column_name]
            if pd.isna(first_value):
                first_value = df[column_name].dropna().iloc[0]

In [ ]:
fill_mids(d1, 'mid')
d1.head()

In [22]:
d1.head()

  mid  cust_id  rating        date
0   1       1:     NaN         NaN
1   1  1488844     3.0  2005-09-06
2   1   822109     5.0  2005-05-13
3   1   885013     4.0  2005-10-19
4   1    30878     4.0  2005-12-26

In [23]:
d1.iloc[2851]

mid                 5
cust_id       1745265
rating            5.0
date       2005-02-08
Name: 2851, dtype: object

In [24]:
mid_index

           mid
0            1
548          2
694          3
2707         4
2850         5
...        ...
24046714  4495
24047329  4496
24056849  4497
24057564  4498
24057834  4499

[4499 rows x 1 columns]

In [25]:
d1.iloc[24057835]

mid              4499
cust_id         66358
rating            3.0
date       2004-12-20
Name: 24057835, dtype: object

In [27]:
#removing cust id with movie ids in them

d1['cust_id'].str.contains(':').sum()

4499

In [32]:
d1 = d1[~d1['cust_id'].str.contains(':')]
d1.shape

(24053764, 4)

In [33]:
d1.head()

  mid  cust_id  rating        date
1   1  1488844     3.0  2005-09-06
2   1   822109     5.0  2005-05-13
3   1   885013     4.0  2005-10-19
4   1    30878     4.0  2005-12-26
5   1   823519     3.0  2004-05-03

In [39]:
d1.iloc[693]

mid                 3
cust_id        712664
rating            5.0
date       2004-02-01
Name: 696, dtype: object

In [40]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 24053764 entries, 1 to 24058262
Data columns (total 4 columns):
 #   Column   Dtype
---  ------   -----
 0   mid      object
 1   cust_id  object
 2   rating   float64
 3   date     object
dtypes: float64(1), object(3)
memory usage: 917.6+ MB

In [44]:
d1['date'] = d1['date'].astype('datetime64[ns]')
d1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 24053764 entries, 1 to 24058262
Data columns (total 4 columns):
 #   Column   Dtype
---  ------   -----
 0   mid      object
 1   cust_id  object
 2   rating   float64
 3   date     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 917.6+ MB

In [45]:
d1.head()

  mid  cust_id  rating       date
1   1  1488844     3.0 2005-09-06
2   1   822109     5.0 2005-05-13
3   1   885013     4.0 2005-10-19
4   1    30878     4.0 2005-12-26
5   1   823519     3.0 2004-05-03

In [48]:
d1['year'] = d1['date'].dt.year

In [49]:
d1.head()

  mid  cust_id  rating       date  year
1   1  1488844     3.0 2005-09-06  2005
2   1   822109     5.0 2005-05-13  2005
3   1   885013     4.0 2005-10-19  2005
4   1    30878     4.0 2005-12-26  2005
5   1   823519     3.0 2004-05-03  2004

In [50]:
d1['month'] = d1['date'].dt.month
d1.head()

  mid  cust_id  rating       date  year  month
1   1  1488844     3.0 2005-09-06  2005      9
2   1   822109     5.0 2005-05-13  2005      5
3   1   885013     4.0 2005-10-19  2005     10
4   1    30878     4.0 2005-12-26  2005     12
5   1   823519     3.0 2004-05-03  2004      5

In [51]:
d1['day'] = d1['date'].dt.day
d1.head()

  mid  cust_id  rating       date  year  month  day
1   1  1488844     3.0 2005-09-06  2005      9    6
2   1   822109     5.0 2005-05-13  2005      5   13
3   1   885013     4.0 2005-10-19  2005     10   19
4   1    30878     4.0 2005-12-26  2005     12   26
5   1   823519     3.0 2004-05-03  2004      5    3

In [60]:
#quarterly bins

def quarter(row):
    if row['month'] < 4:
        return 1
    elif 4 <= row['month'] < 7:
        return 2
    elif 7 <= row['month'] < 9:
        return 3
    else:
        return 4

In [62]:
d1['fisc_Q'] = d1.apply(quarter, axis=1)
d1.head()

  mid  cust_id  rating       date  year  month  day  fisc_Q
1   1  1488844     3.0 2005-09-06  2005      9    6       4
2   1   822109     5.0 2005-05-13  2005      5   13       2
3   1   885013     4.0 2005-10-19  2005     10   19       4
4   1    30878     4.0 2005-12-26  2005     12   26       4
5   1   823519     3.0 2004-05-03  2004      5    3       2

In [64]:
d1.to_csv('data/d1_clean.csv')